lkolbly/cmsis-svd/data/TexasInstruments/LM3S5C31.svd
        <register>
          <name>DSLPCLKCFG</name>
          <description>Deep Sleep Clock Configuration</description>
          <addressOffset>0x00000144</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DSLPCLKCFG_O</name>
              <description>Clock Source</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_IGN</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_IO</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_30</name>
                  <description>30 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_32</name>
                  <description>32.768 kHz</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DSLPCLKCFG_D</name>
              <description>Divider Field Override</description>
              <bitRange>[28:23]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_1</name>
                  <description>System clock /1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_2</name>
                  <description>System clock /2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_3</name>
                  <description>System clock /3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_4</name>
                  <description>System clock /4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_64</name>
                  <description>System clock /64</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCCAL</name>
          <description>Precision Internal Oscillator Calibration</description>
          <addressOffset>0x00000150</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PIOSCCAL_UT</name>
              <description>User Trim Value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_UPDATE</name>
              <description>Update Trim</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_CAL</name>
              <description>Start Calibration</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_UTEN</name>
              <description>Use User Trim Value</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCSTAT</name>
          <description>Precision Internal Oscillator Statistics</description>
          <addressOffset>0x00000154</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PIOSCSTAT_CT</name>
              <description>Calibration Trim Value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCSTAT_CR</name>
              <description>Calibration Result</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRNONE</name>
                  <description>Calibration has not been attempted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRPASS</name>
                  <description>The last calibration operation completed to meet 1% accuracy</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRFAIL</name>
                  <description>The last calibration operation failed to meet 1% accuracy</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_PIOSCSTAT_DT</name>
              <description>Default Trim Value</description>
              <bitRange>[22:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC9</name>
          <description>Device Capabilities 9 ADC Digital Comparators</description>
          <addressOffset>0x00000190</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC9_ADC0DC0</name>
              <description>ADC0 DC0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC1</name>
              <description>ADC0 DC1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC2</name>
              <description>ADC0 DC2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC3</name>
              <description>ADC0 DC3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC4</name>
              <description>ADC0 DC4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC5</name>
              <description>ADC0 DC5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC6</name>
              <description>ADC0 DC6 Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC7</name>
              <description>ADC0 DC7 Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC0</name>
              <description>ADC1 DC0 Present</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC1</name>
              <description>ADC1 DC1 Present</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC2</name>
              <description>ADC1 DC2 Present</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC3</name>
              <description>ADC1 DC3 Present</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC4</name>
              <description>ADC1 DC4 Present</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC5</name>
              <description>ADC1 DC5 Present</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC6</name>
              <description>ADC1 DC6 Present</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC7</name>
              <description>ADC1 DC7 Present</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSTAT</name>
          <description>Non-Volatile Memory Information</description>
          <addressOffset>0x000001A0</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_NVMSTAT_FWB</name>
              <description>32 Word Flash Write Buffer Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
